{
  "pageTitle": "The Pre [XYZ] Era",
  "pageDescription": "All the beats I made before the [XYZ] era. I started using BandLab more to make beats and I got a little better at it.",
  "items": [
    {
      "versions": [
        {
          "name": "Lady Sample",
          "date": "Aug 13, 2024",
          "description": "At this point I was trying to become more of a standard producer, which I guess I thought was just using a bunch of samples. I thought this sample was really good so I wanted to chop it up, but I didn’t.\nThis was made on BandLab, it was never released.",
          "audio": "https://audio.jukehost.co.uk/Rg3pV70yoikxl9Ed82sfybp2lKswkMmn"
        }
      ]
    },
    {
      "versions": [
        {
          "name": "diddybound",
          "date": "Aug 21, 2024",
          "description": "I tried sampling more and this time, and this time I only got as far as importing the sample. I think I didn’t work on it because it was on my phone, and BandLab on mobile is clapped. This also seemed to be the start of my short stint of being obsessed with saying Diddy. So this is called diddybound because its named after Earthbound, but the sample is actually from the SNES Classic menu theme, which is the console I first played Earthbound on.\nThis was made on BandLab, it was never released.",
          "youtube": "https://youtu.be/pvbJAVKQ1YM"
        }
      ]
    },
    {
      "versions": [
        {
          "name": "Diddy Fonem",
          "date": "Aug 26, 2024",
          "description": "So this was supposed to be my next solo song. I had this idea while on the beach on the last day of vacation and somehow was able to remember it for like 6 hours over the flight home. Finally I was home and I wrote some of it out and I finished some more of it later.\nThis was made on BandLab, it was never released. But I did preview it to a few people.",
          "audio": "https://audio.jukehost.co.uk/UIDVHteKBdtZ7ykzruYQxRbtg8NefruE"
        }
      ]
    },
    {
      "versions": [
        {
          "name": "Feelin Like P Diddy",
          "date": "Aug 30, 2024",
          "description": "This was supposed to be the next Cream Day parody, but we only got as far as completing some of the lyrics.",
          "youtube": "https://youtu.be/iP6XpLQM2Cs",
          "youtubeText": "▶ What We Were Going To Parody"
        }
      ]
    },
    {
      "versions": [
        {
          "name": "Victim",
          "date": "Sep 20, 2024",
          "description": "This was supposed to be my addition to a big 3 part music thing between each of the Cream Day members where it’s like a murder mystery, with Jimmy Frankfurt being the detective, lil kc being the Killer, and me being the victim. None of us ever finished it and eventually we forgot about it.\nThis was made on BandLab.",
          "audio": "https://audio.jukehost.co.uk/4WZdBkEj4LJJL1FASZD7cuYckoZXq9Pk"
        }
      ]
    },
    {
      "versions": [
        {
          "name": "New Project",
          "date": "Sep 22, 2024",
          "description": "This was an older version of “ShoeBUM owned” so the story behind this was I had a friend who went by ShoeGanger and he had heard that I was making music and he told me he was gonna make a diss track on me so I was gonna make a counter diss beforehand so i could come out on top, so I tried to make some cover of Jamming by Bob Marley which is a song he liked so it would make sense but he never ended up making the diss so mine never released.\nThis was made on BandLab, it was never released.",
          "audio": "https://audio.jukehost.co.uk/jCtnPH8mrgxmoxuTKuOwHdIt1dAtmeYM"
        },
        {
          "name": "ShoeBUM owned",
          "date": "Sep 26, 2024",
          "description": "The latest version of ShoeBUM owned.\nThis was made on BandLab, it was never released.",
          "audio": "https://audio.jukehost.co.uk/597sZQjOY5LUfS8BoTGUE4rLwsRldm4m"
        }
      ]
    },
    {
      "versions": [
        {
          "name": "Davola",
          "date": "Oct 02, 2024",
          "description": "This is one of the better songs I had made so far. It was sampling the Crazy Joe Davola sad clown song from Seinfeld, one of my favorite shows. I started focusing more on drums so there's a little more effort put into them here, I don't really know the genre of the drums so maybe it's jerk idk.\nThis was made on BandLab, it was never released.",
          "audio": "https://audio.jukehost.co.uk/2YwPzmv4SyLMKm5xtK7qsMElC9i3ukrP"
        }
      ]
    },
    {
      "versions": [
        {
          "name": "rain",
          "date": "Oct 12, 2024",
          "description": "So here I was sampling more and I thought I was Kanye or something sampling some soul song. So anyway I tried to sample Remember The Rain by 21st Century, but I only got as far as importing it into Bandlab.",
          "youtube": "https://youtu.be/nn72xd_MkMs"
        }
      ]
    }
  ]
}

