{
  "pageTitle": "The Cream Day Era",
  "pageDescription": "The Cream Day Era saw me joining a pseudo band with a few of my friends. The band (called Cream Day) contained P Slimer, lil kc (the new name of Lil Yom), and Jimmy Frankfurt Da Rappa (one of my and lil kc’s irl friends). We only really released one song as a trio, but there were a few songs leading up to the release of Greetings Loved Ones.\nThe idea with Cream Day was to make... freaky parodies.",
  "items": [
    {
      "versions": [
        {
          "name": "Mary Had A Little Choad, Yo",
          "date": "Aug 05, 2024",
          "description": "This was the first song I ever released solo on BandLab. I had a midi keyboard and was messing around with it, trying to play some melodies. I started recording and playing Mary Had a Little Lamb and I messed it up a few times. But I persevered and after I finished recording, I decided to add drums. And after that, I added some vocals over it.\nThis was released on BandLab - and later - Soundcloud.",
          "audio": "https://audio.jukehost.co.uk/b5yAnZJW3UFYPk1BUSmT3adoFknXl6Fz"
        }
      ]
    },
    {
      "versions": [
        {
          "name": "Song Of The Summer! (ft. lil kc)",
          "date": "Aug 14, 2024",
          "description": "To be honest I don’t really know the story behind this. I just made some weird non-music soundscape of a concert with some crowd members being heard. See if you can pick them all out. Also fun fact, the owl sound at the start was going to be my producer tag.\nThis was released on BandLab - and later - Soundcloud.",
          "audio": "https://audio.jukehost.co.uk/XxrmHIQaWgXORDRNg2oRbKDZxwTDivCX"
        }
      ]
    },
    {
      "versions": [
        {
          "name": "Greetings Loved Ones (ft. lil kc & freaky j)",
          "date": "Aug 15, 2024",
          "description": "The original version of Greetings Loved Ones. Me and lil kc were up late at night again and we decided to make a song again. We decided to make a classical parody of California Gurls. It was pretty clapped. At this point it was just me, lil kc, and freaky j. Freaky j never ended up recording on this, but he will come back later, trust me...\nThis never officially released.",
          "audio": "https://audio.jukehost.co.uk/x2qcKTgfw9I36goNO4xp7tVypOO7bp1p"
        },
        {
          "name": "sigma",
          "date": "Aug 15, 2024",
          "description": "So this was a pluggnb remix of Greetings Loved Ones (ft. lil kc & freaky j). I guess at this time I was really into pluggnb remixes. I don't think I ever finished this, so it's pretty clapped. I didn't make this beat, all I did was paste the vocals on top of it.\nThis never officially released.",
          "audio": "https://audio.jukehost.co.uk/vi6bXgxbQDJMWuNseBXZmPRkg7PeyDfQ"
        },
        {
          "name": "Greetings Loved Ones (ft. Lil Kc & Jimmy Frankfurt Da Rappa)",
          "date": "Sep 13, 2024",
          "description": "THIS HAD THE FIRST APPEARANCE OF THE P SLIMER PRODUCER TAG\nThe Official Release version of Greetings Loved Ones. Freaky J was cut, and the final member of Cream Day was featured; Jimmy Frankfurt The Rappa. This song actually had some more effort put into it than any before. However, it was very freaky. Just ignore this...\nThis was released on BandLab - and later - Soundcloud, and I believe did get a music video.",
          "image": "https://github.com/JettisonTM/JettisonTM.github.io/blob/main/media/in-memoriam/cream-day.png?raw=true",
          "audio": "https://audio.jukehost.co.uk/2k6uG8kfy9kdKtMHWa6FkpQMcZByVkx2"
        }
      ]
    }
  ]
}
