{
  "pageTitle": "The E L E M E N T [X] Era",
  "pageDescription": "Around this time I was trying to get a little better at making beats, and Freaky J and I wanted to release something bigger. We got to work on our first single.",
  "items": [
    {
      "versions": [
        {
          "name": "ken goonson",
          "date": "Oct 16, 2024",
          "description": "This was a melody that I completely stole from a YouTube tutorial. I made it because Freaky J said he wanted to make a Ken Carson type song, so I tried to make a beat but I was buns at making melodies so I lowk stole one from this youtube video: https://youtu.be/9ntcPgpateA and added some 808s, and a buns lead at the end that was later scrapped. But I showed it to Freaky J and he said it was tuff.\nThis went on to later become E L E M E N T [X].",
          "audio": "https://audio.jukehost.co.uk/TAUDx3PPaYGYYSCI5nmbldv6bsAAEU4H"
        }
      ]
    },
    {
      "versions": [
        {
          "name": "landon bedtime lore",
          "date": "Oct 20, 2024",
          "description": "I tried to do a beat remake of Righteous by Mo Beats, and it was pretty good. Then this kid named Landon was being a bum so I dissed him on the beat. I showed it to a few people and they liked it.",
          "audio": "https://audio.jukehost.co.uk/9IZWQhuEDgTamBzfkOEFv6acrx3EliWL"
        }
      ]
    },
    {
      "versions": [
        {
          "name": "cheif lil fettily wap guy lore keef",
          "date": "Oct 20, 2024",
          "description": "This was a joke song I made for fun that sampled Family Guy, Righteous, Fetty Wap, Chief Keef, and Bob Marley - because I had the file on my pc from the Shoebum song. It was kinda funny idk. I showed it to my friends and they thought it was cool.",
          "audio": "https://audio.jukehost.co.uk/vvVL1csl0YBDdHNR9UZLxlP2OiReL458"
        }
      ]
    },
    {
      "versions": [
        {
          "name": "coop lore",
          "date": "Oct 20, 2024",
          "description": "This was another joke song made right after the last one while on call with this kid named Coop. There's not a lot to it, I just made an intro and then pasted the Family Guy intro with BandLab autotune on it. I showed it to the people in VC and they liked it.",
          "audio": "https://audio.jukehost.co.uk/xeuqhhTOuahvtrl8fpfIMoBefimeoC89"
        }
      ]
    },
    {
      "versions": [
        {
          "name": "[X] V1",
          "date": "Oct 20, 2024",
          "description": "I started working on the beat more and added some drums, I also removed the boof lead and added an arp because I thought arps were tuff at the time.",
          "audio": "https://audio.jukehost.co.uk/BQh6QAfhVuy5CQChuBiR0oJ2im9mO0zw"
        },
        {
          "name": "[X] V2",
          "date": "Oct 20, 2024",
          "description": "I started arranging the beat a little bit and I added a pitched up part to the melody which was tuff. I previewed it to Freaky J and he liked it.",
          "audio": "https://audio.jukehost.co.uk/83VHxbZmWE27WsbS1XGNd8a9v5SIscbJ"
        },
        {
          "name": "[X] V3",
          "date": "Oct 21, 2024",
          "description": "The first verse was dropped by P Slimer, and some more arrangement was done to the beat.",
          "audio": "https://audio.jukehost.co.uk/tvYZwtU9fA5CCLnxgS8WbMqBvG4S5pZl"
        },
        {
          "name": "E L E M E N T [X]",
          "date": "Oct 21, 2024",
          "description": "This is the original E L E M E N T [X] release. The beat was completely made in about a week, and then the vocals were added. This was the start of the collaboration between P Slimer and Jizza (Freaky J’s new name). Many agree that P Slimer had a better performance than Jizza, due to Jizza’s poor vocals that were recorded at midnight. The album cover that was used was kinda clapped but it worked well enough.\nAnd with that, the [XYZ] era began.",
          "audio": "https://audio.jukehost.co.uk/jt8yJXI0vORciHrCEWmpDjaTKOYMA44P",
          "image": "https://raw.githubusercontent.com/JettisonTM/JettisonTM.github.io/424cf8b6ca19829a9cf684549ea09db0e626438c/media/in-memoriam/element-x_cover.png"
        }
      ]
    }
  ]
}
